package com.cjj.shopapp.constants;

import com.cjj.shopapp.activity.R;

public class Constants {
	public static int[] category_icon = new int[] { R.drawable.lizhi, R.drawable.baihe,
			R.drawable.gaoda, R.drawable.gaoxiao, R.drawable.kehuan,
			R.drawable.qingnian, R.drawable.shaonv, R.drawable.tiyu,
			R.drawable.xuanyi, R.drawable.zhiyu };
	public static String[] category_msg = new String[] { "励志", "百合", "高达", "搞笑", "科幻", "青年",
			"少女", "体育", "推理", "治愈" };
	public static int[] hot_icon = new int[] { R.drawable.hot_bg1, R.drawable.hot_bg2,
		R.drawable.hot_bg3, R.drawable.hot_bg4 };
	public static String[] hot_title = new String[]{
		"火影忍着","海贼王","刀剑神域","起风了"
	};
	public static String[] hot_intro = new String[]{
		"这是一个忍者的世界。因为身上封印着邪恶的九尾妖狐，鸣人受尽了村人的冷落，只是拼命用各种恶作剧试图吸引大家的注意力。好在还是有依鲁卡老师的关心，鸣人的性格才没有变得扭曲，他总是干劲十足、非常乐观。为了让更多的人认可自己，鸣人的目标是成为火影。鸣人的同伴，是由老师确定的同班同学，随着共同的战斗，终于成了互相认可、信赖的好伙伴。",
		"拥有财富、名声、权力，这世界上的一切的男人 “海贼王”哥尔·D·罗杰，在被行刑受死之前说了一句话，让全世界的人都涌向了大海。",
		"《刀剑神域》SAO篇故事背景设定在2022年，讲述了一个发生在网络角色扮演游戏“刀剑神域”（sword art online，简称SAO）中的奇妙故事。SAO是一个可以容纳一万一千名游戏者的大型网络游戏，参加了游戏的主人公桐人得知了“在游戏中死去的人在现实中也会死去”的惊人事实。而想从游戏中逃脱，唯一办法就是打倒位于艾恩葛朗特顶楼第100层的头目。于是，桐人投身到了看不见尽头的游戏战斗之中。ALO篇桐人从禁忌的死亡战斗MMO《SwordArtOnline刀剑神域》回到现实世界后，立刻前去寻找游戏时的伙伴——同时也是心仪对象的亚丝娜。但结城明日奈（亚丝娜）却还没从那个噩梦般的游戏里归来。桐人也因此而陷入困惑与绝望当中。他唯一的线索，是亚丝娜以“妖精”模样伫立在鸟笼里的奇异影像档案。亚丝娜似乎是被困在一款高性能的VRMMO游戏《ALtheimOnline》里面。桐人为了解救亚丝娜，一头闯入这个有着无数妖精飞翔交错的“ALO”世界……在网络上人气超高的“妖精之舞”篇，正式展开！",
		"从大正到昭和的这段时光，20世纪20~30年代的日本动荡不安，贫困与疾病，加上不景气的经济和破坏力巨大的关东大地震，让生活在这座岛屿上的人民惶惶不可终日。而随着战争脚步的临近，年轻人们的未来愈加变得扑朔迷离，捉摸不定。自幼便对飞机抱以浓厚兴趣的堀越二郎（庵野秀明 配音），与他所景仰的意大利飞机设计师卡普罗尼（野村万斋 配音）建立了穿越时空的友情，并从对方那里汲取勇气和灵感。他发誓设计并制造出优美的飞机，长大后如愿考入东京某大学学习航空工学。在此之后，他远赴德国留学，凭借自身掌握的航空技术，二郎成为一名战斗机设计师，经典机型七试舰上战斗机（九六式舰上战斗机）便曾留下他智慧的结晶。可在一次试飞中，他的飞机意外坠毁，颇受打击的二郎前往位于长野县北佐久郡的轻井泽疗养，谁知竟在那里结识了一生的最爱。纵有疾风起,人生不言弃。她叫菜穗子（泷本美织 配音），在1923年9月1日（日本十年前的关东大地震期间）曾与二郎有过一面之缘。两人一见钟情，彼此约定相守终生。然而菜穗子罹患了在当时被视作绝症的肺结核，前方的道路一片黑暗。但二郎始终无法放弃制造优美飞机的梦想，二郎再度投身零式战斗机的设计工作中去。另一方面，自知去日无多的菜穗子偷偷溜出疗养院，奔向她的爱人二郎。动荡的年代，有限的生命，青年男女风中残烛般的飘摇爱情。"
	};
}
